       ID DIVISION.
       PROGRAM-ID. MIGTEST.
      *
      * test tcs mig x41 in a commnet line
      * BADLINE <LABEL:ACE-14> 123456789
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'MIGTEST here'.
           STOP RUN.
